////
////  Lv4.swift
////  NumberBaseBallGame
////
////  Created by 민웅킴 on 3/12/24.
////
//
//import Foundation
//
//class 혹은 struct {
//    func start() {
//    while XX { // while 뒤의 조건(XX) 작성해보기
//      // 1. 안내문구 출력
//      
//        // 2. 유저의 입력값을 받음
//           
//        // 3. 입력값에 따라 처리(switch - case 활용해보기)
//        switch 입력값 {
//            case
//                // 1을 입력한 케이스 작성
//            case
//                // 2을 입력한 케이스 작성
//            case
//                // 3을 입력한 케이스 작성
//            default
//        }
//    }
//    }
//}
//
///*
// 프로그램을 시작할 때 안내문구를 보여주세요
// // 예시
// 환영합니다! 원하시는 번호를 입력해주세요
// 1. 게임 시작하기  2. 게임 기록 보기  3. 종료하기
// ​
// 1번 게임 시작하기의 경우 “필수 구현 기능” 의 예시처럼 게임이 진행됩니다
// 정답을 맞혀 게임이 종료된 경우 위 안내문구를 다시 보여주세요
// // 예시
// 환영합니다! 원하시는 번호를 입력해주세요
// 1. 게임 시작하기  2. 게임 기록 보기  3. 종료하기
// 1 // 1번 게임 시작하기 입력
//
// < 게임을 시작합니다 >
// 숫자를 입력하세요
// .
// .
// .
// */
