////
////  Lv6.swift
////  NumberBaseBallGame
////
////  Created by 민웅킴 on 3/12/24.
////
//
//import Foundation
////
//class Lv6 {
//let n : Int
//init(n: Int) {
//    self.n = n
//}
//    func start(입력값: Lv6) {
//    while true { // while 뒤의 조건(XX) 작성
////        // 안내문구 출력
////        // 유저의 입력값을 받음
////           
////        // 유저의 잘못된 입력값에 대한 처리 로직 구현
////          
//        switch `입력값` {
//        case .start:
//          return      // 1을 입력한 케이스
//        case .log:
//          return      // 2을 입력한 케이스
//        case .exit:
//           return     // 3을 입력한 경우 프로그램 종료시키기. while 뒤 조건 XX를 조작하기
//        default: return
//        }
//    }
//    }
//}
//
//enum Lv6 {
//  case start
//  case log
//  case exit
//}
//
///*
// 3번 종료하기의 경우 프로그램이 종료됩니다
// 이전의 게임 기록들도 초기화됩니다
// // 예시
// 환영합니다! 원하시는 번호를 입력해주세요
// 1. 게임 시작하기  2. 게임 기록 보기  3. 종료하기
// 3 // 3번 종료하기 입력
//
// < 숫자 야구 게임을 종료합니다 >
// ​
// 1, 2, 3 이외의 입력값에 대해서는 오류 메시지를 보여주세요
// // 예시
// 환영합니다! 원하시는 번호를 입력해주세요
// 1. 게임 시작하기  2. 게임 기록 보기  3. 종료하기
// 4
//
// 올바른 숫자를 입력해주세요!
// ​
// 코드 뼈대 보기(어떻게 시작할지 막막한 경우에만 참고)
// class 혹은 struct {
//     func start() {
//     while XX { // while 뒤의 조건(XX) 작성
//         // 안내문구 출력
//         // 유저의 입력값을 받음
//            
//         // 유저의 잘못된 입력값에 대한 처리 로직 구현
//           
//         switch 입력값 {
//             case
//                 // 1을 입력한 케이스
//             case
//                 // 2을 입력한 케이스
//             case
//                 // 3을 입력한 경우 프로그램 종료시키기. while 뒤 조건 XX를 조작하기
//             default
//         }
//     }
//     }
// }
// */
